# .append()  გამოიყენება სიის ბოლოში ახალი ელემენტის დასამატებლად
# .insert() საშუალებას გვაძლევს ელემენტი ჩავსვათ სიის ნებისმიერ კონკრეტულ პოზიციაზე 
# 3. .pop()  შლის ელემენტს სიიდან 



რიცხვების_სია = [2, 3, 5]
for i in range(5):
    რიცხვი = int(input("შემოიტანეთ  რიცხვი: "))
    რიცხვების_სია.append(რიცხვი)
print(რიცხვების_სია)


მანქანების_სია = ["BMW", "Mercedes", "Audi", "Toyota", "Porsche", "Honda"]
რაოდენობა = len(მანქანების_სია)
print(რაოდენობა)


colors = ["red", "green", "blue", "yellow", "purple"]
colors.pop(-1)

animals = ["dog", "cat", "elephant", "lion"]
animals.insert(1, 'monkey')
print(animals)

სტუდენტები = []
for i in range(3):
    სახელი = input("შეიყვანეთ სტუდენტის სახელი: ")
    სტუდენტები.append(სახელი)
სტუდენტები.insert(0, "Teachr")
სტუდენტები.pop()
სიის_სიგრძე = len(სტუდენტები)
print(" შედეგები ")
print("სიის საბოლოო სიგრძეა:", სიის_სიგრძე)
print("საბოლოო სია:", სტუდენტები)

