# რა არის ბინარული კოდი და რატომ იყენებს კომპიუტერი მხოლოდ 0-სა და 1-ს?
# ბინარული კოდი არის კოდი რომელიც იწერება 0-ის და 1-ის გამოყენებით ნული არის false და 1 არის true

# input არის ა)
# output არის ბ)

# string
# integer
# float
# string

# print('GOA'*3) ით დაიბეჭდება GOAGOAGOA

# ბ)

# რეინიციალიზაცია ნიშნავს კოდის გადახედვას შეცდომების საპოვნელად

# print(17 // 5)ს შედეგი იქნება 3
# print(17 % 5)ს შედეგი იქნება 2

# პასუხი Float იმიტომ არის რომ 12:3 ზე მთელი რიცხვია

# კონკატენაცია არის სიტყვების მიმატება 

# print("10" + "5")ს შედეგი იქნება 105
# print(10 + 5)ს შედეგი იქნება 15

# print(str(25) + " years")ს შედეგი იქნება 25 years

# implict და explicit type conversionს შრის განსხვავება ისაა რომ implict ის დროს თვითონ იცვლება მონაცემთა ტიპი explicit ის დროს კი ჩვენ ვცვლით მაგალითად str()

# true

# true

# algorithm ის მეშვეობით კომპიუტერი კითხულობს კოდს თანმიმდევრობით

# Flowchart იყეენებს ფოტოებს კოდისთვის
# Pseudocode აროს კოდერებისთვის რომელთაც იციან coding
# Natural Language არის იმათთვიც ვინც არც ისე კარგად იცის coding

# იდენტაცია პითონში არის დაშორებები რომ ადამიანმა კარგად დაინახოს კოდი

# for i in range(3):
# print(i)ს მეშვეობით დაიპრინტება 0 1 2

# for i in range(2, 10, 3):
# print(i)ს მეშვეობით დაიპრინტება 5, 8

# for i in  range(2,20,2)

# # რა იქნება შედეგი?
# name = "Python"
# print(name.lower()) python 
# print(name.upper()) PYTHON
# print(name.capitalize()) Python

# word = "banana"
# print(word.count("a")) 3
# print(len(word)) 6

# paramater არის ცვლადის სახელი
# argument არის ცვლადში რაც ინახება

# def hello(name, age):
# print(name)
# hello("Andria")
# ამ კოდში შეცდომა ისაა რომ 2 არგუმენტი გვაქ მოცემული და მარტო 1 პასუხი გვიწერია

# for ციკლის შექმნისას ვწერთ for-s შემდეგ i in range(): და ფრჩხილებში ვწერთ რამდენჯერ გვინდა დაიწეროს შემდეგ მეორე ხაზზე ვწერთ print(i)

# for ციკლს ვიყენებთ მაშინ როცა ვიცით რამდენჯერ გვჭირდება კოდის დაწერა ხოლო whileს ვიყენებთ მაშინ როცა არ ვიცით

# for i in range(1, 20):

# i=10
# while i>0:
    # print(i)
    # i=-1
    
# for i in range(2, 11, 2):
# print(i) გამოიტანს  4, 6, 8,10

# ჯამი=0
# for i in range(1, 101):
#   print(ჯამი+i)
#   ჯამი=ჯამი + i
#   print(ჯამი)


